package lecture04;

public class BFS {
    /**
     * BFS의 목적은 임의의 정점에서 시작해서, 모든 정점을 한 번씩 방문하는 것
     * BFS는 최단 거리를 구하는 알고리즘
     * BFS는 모든 가중치가 1일 때, 최단 거리를 구하는 알고리즘
     * BFS를 이용해 해결할 수 있는 문제는 아래와 같은 조건을 만족해야 한다.
     * 1. 최소 비용 문제인가
     * 2. 간선의 가중치가 1인가
     * 3. 정점과 간선의 개수가 적은가? (적다는 것은 문제의 조건에 맺춰 해결할 수 있다는 것을 의미) 시간과 메모리 제한
     * 간선의 가중치가 문제에서 구하라고 하는 최소 비용과 의미가 일치해야 한다.
     * 즉, 거리의 최소값을 구하는 문제라면 가중치는 거리를 의미해야 하고, 
     * 시간의 최소값을 구하는 문제라면 가중치는 시간을 의미해야 한다.
     * No2178(미로 탐색)
     * No7576(토마토)
     * No1697(숨바꼭질)
     */
}
